doublemarkpro/ESP32-HanDictionary/main/boards/m5stack/tab5/m5stack_tab5.cc
    bool Read(uint16_t& millivolts, int& current_ma) {
        uint16_t bus_raw = 0, shunt_raw = 0;
        if (device_ == nullptr || !ReadRegister(0x02, bus_raw) || !ReadRegister(0x01, shunt_raw))
            return false;
        millivolts = static_cast<uint16_t>((static_cast<uint32_t>(bus_raw) * 5) / 4);
        // 2.5 uV per bit / 5 mOhm = 0.5 mA per bit. On Tab5, charge current is
        // negative at the shunt, so expose positive current for charging.
        current_ma = -static_cast<int16_t>(shunt_raw) / 2;
        return millivolts >= 5000 && millivolts <= 9000;
    }

private:
    bool ReadRegister(uint8_t reg, uint16_t& value) {
        uint8_t bytes[2]{};
        auto err = i2c_master_transmit_receive(device_, &reg, 1, bytes, sizeof(bytes), 100);
        if (err != ESP_OK)
            return false;
        value = static_cast<uint16_t>(bytes[0] << 8 | bytes[1]);
        return true;
    }

    bool WriteRegister(uint8_t reg, uint16_t value) {
        uint8_t bytes[] = {reg, static_cast<uint8_t>(value >> 8), static_cast<uint8_t>(value)};
        return i2c_master_transmit(device_, bytes, sizeof(bytes), 100) == ESP_OK;
    }

    i2c_master_dev_handle_t device_ = nullptr;
};

int Tab5BatteryLevelFromVoltage(uint16_t pack_mv) {
    // The Tab5 battery is a 2-cell Li-ion pack. Voltage is not a coulomb counter, so use a
    // conservative discharge curve instead of presenting the pack voltage as a linear gauge.
    struct Point {
        int cell_mv;
        int level;
    };
    static constexpr Point curve[] = {
        {3000, 0},  {3400, 5},  {3600, 15}, {3700, 30},  {3800, 50},
        {3900, 70}, {4000, 85}, {4100, 97}, {4150, 100},
    };
    const int cell_mv = pack_mv / 2;
    if (cell_mv <= curve[0].cell_mv)
        return curve[0].level;
    for (size_t index = 1; index < std::size(curve); ++index) {
        if (cell_mv <= curve[index].cell_mv) {
            const auto& low = curve[index - 1];
            const auto& high = curve[index];
            return low.level + (cell_mv - low.cell_mv) * (high.level - low.level) /
                                   (high.cell_mv - low.cell_mv);
        }
    }
    return 100;
}

class M5StackTab5Board : public WifiBoard {
private:
    i2c_master_bus_handle_t i2c_bus_;
    std::unique_ptr<Button> boot_button_;
    LcdDisplay* display_;
    EspVideo* camera_ = nullptr;
    Pi4ioe1* pi4ioe1_;
    Pi4ioe2* pi4ioe2_;
    Tab5PowerMonitor power_monitor_;
    bool power_monitor_ready_ = false;
    esp_lcd_touch_handle_t touch_ = nullptr;
#if CONFIG_HAN_DICTIONARY
    sdmmc_card_t* sd_card_ = nullptr;
    bool sd_bus_initialized_ = false;
    bool sd_card_mounted_ = false;
    tinyusb_msc_storage_handle_t usb_storage_ = nullptr;
    bool tinyusb_driver_started_ = false;
    std::unique_ptr<Tab5Keyboard> keyboard_;
#endif

    void InitializeI2c() {
        i2c_master_bus_config_t i2c_bus_cfg = {
            .i2c_port = (i2c_port_t)1,
            .sda_io_num = AUDIO_CODEC_I2C_SDA_PIN,
            .scl_io_num = AUDIO_CODEC_I2C_SCL_PIN,
            .clk_source = I2C_CLK_SRC_DEFAULT,
            .glitch_ignore_cnt = 7,
            .intr_priority = 0,
            .trans_queue_depth = 0,
            .flags =
                {
                    .enable_internal_pullup = 1,
                },
        };
        ESP_ERROR_CHECK(i2c_new_master_bus(&i2c_bus_cfg, &i2c_bus_));
    }

    static esp_err_t bsp_enable_dsi_phy_power() {
        esp_ldo_channel_handle_t ldo_mipi_phy = NULL;
        esp_ldo_channel_config_t ldo_mipi_phy_config = {
            .chan_id = LCD_MIPI_DSI_PHY_PWR_LDO_CHAN,
            .voltage_mv = LCD_MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV,
        };
        return esp_ldo_acquire_channel(&ldo_mipi_phy_config, &ldo_mipi_phy);
    }

    void I2cDetect() {
        uint8_t address;
        printf("     0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f\r\n");
        for (int i = 0; i < 128; i += 16) {
            printf("%02x: ", i);
            for (int j = 0; j < 16; j++) {
                fflush(stdout);
                address = i + j;
                esp_err_t ret = i2c_master_probe(i2c_bus_, address, pdMS_TO_TICKS(200));
                if (ret == ESP_OK) {
                    printf("%02x ", address);
                } else if (ret == ESP_ERR_TIMEOUT) {
                    printf("UU ");
                } else {
                    printf("-- ");
                }
            }
            printf("\r\n");
        }
    }

    void InitializePi4ioe() {
        ESP_LOGI(TAG, "Init I/O Exapander PI4IOE");
        pi4ioe1_ = new Pi4ioe1(i2c_bus_, 0x43);
        pi4ioe2_ = new Pi4ioe2(i2c_bus_, 0x44);
    }

    void ResetLcdAndTouch() {
        ESP_LOGI(TAG, "Reset LCD and touch via PI4IOE");
        gpio_reset_pin(TOUCH_INT_GPIO);

        uint8_t value = pi4ioe1_->ReadOutSet();
        clrbit(value, 4);  // P4 = LCD_RST
        clrbit(value, 5);  // P5 = TP_RST
        pi4ioe1_->WriteOutSet(value);
        vTaskDelay(pdMS_TO_TICKS(100));

        setbit(value, 4);
        setbit(value, 5);
        pi4ioe1_->WriteOutSet(value);
        vTaskDelay(pdMS_TO_TICKS(100));
    }

    static esp_lcd_panel_io_i2c_config_t St712xTouchIoConfig() {
        esp_lcd_panel_io_i2c_config_t config = {};
        config.scl_speed_hz = 100000;
        config.dev_addr = ST712X_TOUCH_I2C_ADDRESS;
        config.control_phase_bytes = 1;
        config.lcd_cmd_bits = 16;
        config.flags.disable_control_phase = 1;
        return config;
    }

    St712xPanel DetectSt712xPanel() {
        esp_lcd_panel_io_handle_t touch_io = nullptr;
        auto touch_io_config = St712xTouchIoConfig();
        esp_err_t ret = esp_lcd_new_panel_io_i2c(i2c_bus_, &touch_io_config, &touch_io);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to create ST712x detection IO (%s); falling back to ST7123",
                     esp_err_to_name(ret));
            return St712xPanel::kSt7123;
        }

        uint8_t firmware_version = 0;
        ret = esp_lcd_panel_io_rx_param(touch_io, 0x0000, &firmware_version,
                                        sizeof(firmware_version));
        esp_lcd_panel_io_del(touch_io);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to read ST712x firmware version (%s); falling back to ST7123",
                     esp_err_to_name(ret));
            return St712xPanel::kSt7123;
        }

        if (firmware_version == 1) {
            ESP_LOGI(TAG, "Detected ST7121 panel (touch firmware version %u)", firmware_version);
            return St712xPanel::kSt7121;
        }
        if (firmware_version != 3) {
            ESP_LOGW(TAG, "Unknown ST712x touch firmware version %u; falling back to ST7123",
                     firmware_version);
        } else {
            ESP_LOGI(TAG, "Detected ST7123 panel (touch firmware version %u)", firmware_version);
        }
        return St712xPanel::kSt7123;
    }

